In [10]:
#1
import pandas as pd
x=pd.Series(['how','are','you'],index=['a','b','c'])
print(x)

a    how
b    are
c    you
dtype: object

In [14]:
#2
series_date = pd.date_range(start='05-01-2021', end ='05-12-2021')
print(series_date)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [22]:
#3
dict1={'name': ['Ann' , 'Balu' , 'Cann'],
      'age': [21,19,29]
      }
dataframe = pd.DataFrame(dict1)
print(dataframe)

   name  age
0   Ann   21
1  Balu   19
2  Cann   29

In [24]:
#4
list1 = [[1,'Anika',24],
        [2,'Shyam',30],
         [2,'Anu',20]
    ]
dataframe = pd.DataFrame(list1,columns = ['id','name','age'])
print(dataframe)

   id   name  age
0   1  Anika   24
1   2  Shyam   30
2   2    Anu   20

In [38]:
#5
dataframe = pd.read_csv('/home/exam1/Desktop/file.csv')
print(dataframe)

   id    name  age  mark
0   1    Zoya   23    95
1   2  Khushi   23    80
2   3     Ann   23    70

In [39]:
#6
print(dataframe)
print()
sorted_frame= dataframe.sort_values(by = ['age','mark'])
print(sorted_frame)

   id    name  age  mark
0   1    Zoya   23    95
1   2  Khushi   23    80
2   3     Ann   23    70

   id    name  age  mark
2   3     Ann   23    70
1   2  Khushi   23    80
0   1    Zoya   23    95

In [42]:
#7
print(sorted_frame)
print()
dataframe_custom = sorted_frame.reset_index()
print(dataframe)

   id    name  age  mark
2   3     Ann   23    70
1   2  Khushi   23    80
0   1    Zoya   23    95

   id    name  age  mark
0   1    Zoya   23    95
1   2  Khushi   23    80
2   3     Ann   23    70

In [45]:
#8
print(dataframe)
print()
select = dataframe.loc[[0,1],:]
print(select)

   id    name  age  mark
0   1    Zoya   23    95
1   2  Khushi   23    80
2   3     Ann   23    70

   id    name  age  mark
0   1    Zoya   23    95
1   2  Khushi   23    80

In [48]:
#9
print(dataframe)
print()
avg=dataframe.groupby('name')['mark'].mean()
print(avg)

   id    name  age  mark
0   1    Zoya   23    95
1   2  Khushi   23    80
2   3     Ann   23    70

name
Ann       70.0
Khushi    80.0
Zoya      95.0
Name: mark, dtype: float64

In [15]:
# 10:GIven a dataframe with NaN values,fill the NaN values with 0

import pandas as pd
import numpy as np
data = {'name': ['Zoya','Shaan','Ann','Sree','Lisa'],
        'mark': [25, 28.6,np.nan,20,np.nan]}
df = pd.DataFrame(data)
print("Original DataFrame")
print(df)
df =  df.fillna(0)
print("\nNew DataFrame replacing all NaN values with 0:")
print(df)

Original DataFrame
    name  mark
0   Zoya  25.0
1  Shaan  28.6
2    Ann   NaN
3   Sree  20.0
4   Lisa   NaN

New DataFrame replacing all NaN values with 0:
    name  mark
0   Zoya  25.0
1  Shaan  28.6
2    Ann   0.0
3   Sree  20.0
4   Lisa   0.0

In [26]:
#11
import pandas as pd
cmpy = {'cname' : ['ABC company', 'XYZ company', 'HSS company'], 'profit' : [-10000,-6000,2000]}
cm = pd.DataFrame(cmpy)
print(cm)

print()
cm['profit'] = cm['profit'].apply(lambda x:x>0)
print(cm)

         cname  profit
0  ABC company  -10000
1  XYZ company   -6000
2  HSS company    2000

         cname  profit
0  ABC company   False
1  XYZ company   False
2  HSS company    True

In [22]:
#12
emp_data={'eid': ['1' , '2' , '3'],
      'ename': [21,19,29],
       'stipend' : [5000,6000,7000]
      }
dataframe1 = pd.DataFrame(emp_data)
print(dataframe1)
print()
company_data={'eid': ['1' , '2' , '3'],
      'designation': ['senior' , 'manager' , 'employee']
      }
dataframe2 = pd.DataFrame(company_data)
print()
print(dataframe2)
print()
output_dataframe = pd.merge(dataframe1,dataframe2, how='inner', on='eid')
print(output_dataframe)

  eid  ename  stipend
0   1     21     5000
1   2     19     6000
2   3     29     7000


  eid designation
0   1      senior
1   2     manager
2   3    employee

  eid  ename  stipend designation
0   1     21     5000      senior
1   2     19     6000     manager
2   3     29     7000    employee